---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinAlternating
source: html/0e45ec1c-66a4-3973-c1f9-2aa6c7314caf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinAlternating Property

"Alternating Bars"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinAlternating { get; }
```